#  #列表
# （1）java 中的数组 必须是相同的数据类型
# int[] arr={11,21,23,45,67} 必须是相同的数据类型
# python 中的列表 可以是不同的数据类型
names = [12, 12, 5, '22']
print(names)  # [12, 12, 5, '22']
# #列表的增删改查
# (2) 列表的增
# 添加到原有列表的最后
names.append("张三")
print(names)  # [12, 12, 5, '22', '张三']
names.append("李四")  # [12, 12, 5, '22', '张三', '李四']
print(names)
# 添加到指定的位置
names.insert(0, "王五")  # 添加到第0个位置
print(names)  # ['王五', 12, 12, 5, '22', '张三', '李四']
names.insert(2, "田二")  # 添加到第二个位置
print(names)  # ['王五', 12, '田二', 12, 5, '22', '张三', '李四']
# 两个列表的合并
# 方式一：
names2 = ['3', 'e', 'd']
names3 = names + names2
print(names3)  # ['王五', 12, '田二', 12, 5, '22', '张三', '李四', '3', 'e', 'd']
# 方式二：
names2.extend(names)
print(names2)  # ['3', 'e', 'd', '王五', 12, '田二', 12, 5, '22', '张三', '李四']
#  (3)列表删除
# 把最后一个元素 删除（从后往前删）
print("删除前")  # ['王五', 12, '田二', 12, 5, '22', '张三', '李四']
print(names)
names.pop()
print(names)  # ['王五', 12, '田二', 12, 5, '22', '张三']
# 删除指定内容的元素(注意只删除一次哦，有多个只删除一个)
names.remove("张三")
print(names)  # ['王五', 12, '田二', 12, 5, '22']
# 列表也可以用下标和切片哦
print(names[0])  # 王五
print(names[0:-1])  # ['王五', 12, '田二', 12, 5]
print(names[0:-1:2])  # ['王五', '田二', 5]
# 删除指定下标的元素
del names[0]
print(names)  # [12, '田二', 12, 5, '22']
# (3)列表改
names[0] = '沙师弟'
print(names)  # ['沙师弟', '田二', 12, 5, '22']
# (4)列表查询
# 判断某个元素在列表中
if "沙师弟" in names:  # 沙师弟在列表中
    print("沙师弟在列表中")
# 判断某个元素不在列表中
if "唐僧" not in names:  # 唐僧不在列表中
    print("唐僧不在列表中")
